[Frost_Trooper X2SoldierClassTemplate]
+DisplayName="Technician"
+ClassSummary="Technicians assist their allies by debuffing the enemy with their gremlin, or weakening them with their sniper rifle."
+LeftAbilityTreeTitle="Captain Cold"
+RightAbilityTreeTitle="Mr.Freeze"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Frozen"
AbilityTreeTitles[2]="Gremlin"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Chill"
+RandomNickNames[1]="Frosty"
+RandomNickNames[2]="Scout"
+RandomNickNames[3]="Iceberg"
+RandomNickNames[4]="Mr.Freeze"
+RandomNickNames[5]="Frozen"

[Fire_Trooper X2SoldierClassTemplate]
+DisplayName="Pyromaniac"
+ClassSummary="Pyromaniacs focus on setting on fire anything that is not on fire. either with their chemthrower for short range, or their special flaming pistol bullets for mid range."
+LeftAbilityTreeTitle="Fire"
+RightAbilityTreeTitle="Flame"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Pyromaniac"
AbilityTreeTitles[2]="Sentry"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Fiery"
+RandomNickNames[1]="Dragon"
+RandomNickNames[2]="Wyvern"
+RandomNickNames[3]="Arsonist"
+RandomNickNames[4]="Pyro"
+RandomNickNames[5]="Wyrm"

[Bio_Trooper X2SoldierClassTemplate]
+DisplayName="Executioner"
+ClassSummary="Executioners are excellent at cleaning up after a hard fought battle. they are able to to slice up or shoot a weakened enemy, or apply a powerful toxin on a big threat."
+LeftAbilityTreeTitle="Poison"
+RightAbilityTreeTitle="Stabbey"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Assassin"
AbilityTreeTitles[2]="Killer"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Plague Doctor"
+RandomNickNames[1]="Assassin"
+RandomNickNames[2]="Gallows"
+RandomNickNames[3]="Hangman"
+RandomNickNames[4]="Zero"
+RandomNickNames[5]="Iron Maiden"

[Acid_Trooper X2SoldierClassTemplate]
+DisplayName="Shredder"
+ClassSummary="Shredders like to get in close either with their shotgun or their sword. they are also able to deal with heavily armoured foes quite easily."
+LeftAbilityTreeTitle="Acid"
+RightAbilityTreeTitle="Sword"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="Blademaster"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Shredder"
+RandomNickNames[1]="Ooze"
+RandomNickNames[2]="Slime"
+RandomNickNames[3]="Blademaster"
+RandomNickNames[4]="Decay"
+RandomNickNames[5]="The End"

[Shock_Trooper X2SoldierClassTemplate]
+DisplayName="Electrician"
+ClassSummary="The Electrician can provide useful suppression or can disable an enemy with their arc thrower or use their specialized bullet to make mecs regret existing."
+LeftAbilityTreeTitle="Taser"
+RightAbilityTreeTitle="Shocker"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Suppression"
AbilityTreeTitles[2]="Tazer"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Shocker"
+RandomNickNames[1]="Tazer"
+RandomNickNames[2]="Zapper"
+RandomNickNames[3]="Gunner"
+RandomNickNames[4]="Power"
+RandomNickNames[5]="Battery"

[Blast_Trooper X2SoldierClassTemplate]
+DisplayName="Demolitionist"
+ClassSummary="Demolitionists like to blow things up they can use either a rocket launcher, grenade launcher, or their specialized bullets to do this."
+LeftAbilityTreeTitle="Blaster"
+RightAbilityTreeTitle="Rocketeer"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Demoman"
AbilityTreeTitles[2]="Rocketeer"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Boomer"
+RandomNickNames[1]="Demoman"
+RandomNickNames[2]="TNT"
+RandomNickNames[3]="Dynamite"
+RandomNickNames[4]="Wastelander"
+RandomNickNames[5]="Liberator"

[Psionic_Trooper X2SoldierClassTemplate]
+DisplayName="Heretic"
+ClassSummary="Heretics employ dark magic they obtained by unknown means and can apply deadly curses or gaini power at a price."
+LeftAbilityTreeTitle="Psi"
+RightAbilityTreeTitle="Mob"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Shadow"
AbilityTreeTitles[2]="Blood"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="Psycho"
+RandomNickNames[1]="Heretic"
+RandomNickNames[2]="Priest"
+RandomNickNames[3]="Demon"
+RandomNickNames[4]="Cultist"
+RandomNickNames[5]="Bishop"

[Slash_Trooper X2SoldierClassTemplate]
+DisplayName="Castle"
+ClassSummary="Castles are the immovable walls of XCOM, able to take a ton of punishment and draw threat towards them."
+LeftAbilityTreeTitle="Psi"
+RightAbilityTreeTitle="Mob"
AbilityTreeTitles[0]="Trick Shots"
AbilityTreeTitles[1]="Turret"
AbilityTreeTitles[2]="Shield Wall"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistol"

+RandomNickNames[0]="The Wall"
+RandomNickNames[1]="Captain"
+RandomNickNames[2]="Immovable"
+RandomNickNames[3]="Unbreakable"
+RandomNickNames[4]="Steadfast"
+RandomNickNames[5]="Stubborn"

